Revit 2027 API
AssetPropertyInteger.IsValidValue Method
 Checks that the value is a valid value for this property.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidValue(
	int value
)
Public Function IsValidValue (
	value As Integer
) As Boolean
public:
bool IsValidValue(
	int value
)
member IsValidValue :
        value : int -> bool
Parameters
value Int32
 The value to be checked.
Return Value
Boolean
 True if the value is valid for the property.
Exceptions
Exception | Condition
InvalidOperationException |  Cannot check validity for a property not being edited in AppearanceAssetEditScope.
See Also
Reference
AssetPropertyInteger Class
Autodesk.Revit.DB.Visual Namespace